import { SVGProps } from 'react';

/**
 * 폴더 잠금 아이콘 컴포넌트
 * 폴더에 잠금(자물쇠) 걸려있음을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 화살표 아이콘 SVG 요소
 */
export const BucketLockIcon = ({ width = '20', height = '20', ...props }: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      version='1.1'
      viewBox='0 0 20 20'
      width={width}
      height={height}
      fill='currentColor'
      {...props}
    >
      <path d='M7.91,13.39c0-1.93.85-3.71,2.32-4.95v-.35c0-2.37,1.97-4.3,4.4-4.3.95,0,1.83.3,2.55.8v-2.06c0-.37-.31-.68-.7-.68h-6.69c-.21,0-.41.09-.54.25l-2.05,2.46H1.2c-.38,0-.7.3-.7.68v9.5c0,.37.31.68.7.68h7.05c-.22-.64-.33-1.33-.33-2.04Z' />
      <path d='M17.18,9.35v-1.26c0-1.37-1.14-2.49-2.55-2.49s-2.55,1.12-2.55,2.49v1.26c-1.39.84-2.32,2.33-2.32,4.04,0,2.62,2.18,4.75,4.87,4.75s4.87-2.13,4.87-4.75c0-1.71-.93-3.2-2.32-4.04ZM14.63,14.3c-.51,0-.93-.41-.93-.9s.41-.9.93-.9.93.41.93.9-.41.9-.93.9ZM15.79,8.78c-.37-.09-.76-.14-1.16-.14s-.79.05-1.16.14v-.69c0-.62.52-1.13,1.16-1.13s1.16.51,1.16,1.13v.69Z' />
    </svg>
  );
};
