import { SVGProps } from 'react';

/**
 * 열린 폴더 아이콘 컴포넌트
 * 열린 폴더 형태의 아이콘을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 화살표 아이콘 SVG 요소
 */
export const BucketEmptyIcon = ({ width = '20', height = '20', ...props }: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      version='1.1'
      viewBox='0 0 20 20'
      width={width}
      height={height}
      fill='currentColor'
      {...props}
    >
      <path d='M19.5,3.74c0-.38-.31-.7-.7-.7h-6.62c-.2,0-.39.09-.53.24l-2.2,2.54H3.51c-.38,0-.7.31-.7.7v2.14h-1.62c-.24,0-.46.13-.58.33-.13.2-.14.45-.04.67l3.24,6.89c.11.24.36.4.63.4h14.37c.06,0,.11,0,.16-.02.01,0,.03,0,.04-.01.04-.01.08-.03.11-.05.01,0,.03-.01.04-.02.04-.03.08-.06.12-.09,0,0,0,0,0,0,.04-.04.07-.08.1-.13,0,0,0,0,.01-.01,0,0,0-.02.01-.03.02-.04.04-.08.05-.12,0-.01,0-.03.01-.04.01-.05.02-.1.02-.15,0,0,0,0,0-.01,0,0,0,0,0,0V3.74ZM4.21,7.22h5.58c.2,0,.39-.09.53-.24l2.2-2.54h5.6v9.19l-2.65-4.66c-.12-.22-.35-.35-.6-.35h0l-10.65.05v-1.44Z' />
    </svg>
  );
};
