import { SVGProps } from 'react';

/**
 * 캘린더 아이콘 컴포넌트
 * 캘릭더 아이콘을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 화살표 아이콘 SVG 요소
 */
export const CalendarIcon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg width='current' height='current' viewBox='0 0 40 40' xmlns='http://www.w3.org/2000/svg' {...props}>
      <path
        fillRule='evenodd'
        clipRule='evenodd'
        d='M16 11.25C16.4142 11.25 16.75 11.5858 16.75 12V13.25H23.25V12C23.25 11.5858 23.5858 11.25 24 11.25C24.4142 11.25 24.75 11.5858 24.75 12V13.25H26C27.5188 13.25 28.75 14.4812 28.75 16V26C28.75 27.5188 27.5188 28.75 26 28.75H14C12.4812 28.75 11.25 27.5188 11.25 26V16C11.25 14.4812 12.4812 13.25 14 13.25H15.25V12C15.25 11.5858 15.5858 11.25 16 11.25ZM14 14.75C13.3096 14.75 12.75 15.3096 12.75 16V16.25H27.25V16C27.25 15.3096 26.6904 14.75 26 14.75H14ZM27.25 17.75H12.75V26C12.75 26.6904 13.3096 27.25 14 27.25H26C26.6904 27.25 27.25 26.6904 27.25 26V17.75ZM21.25 24.5C21.25 24.0858 21.5858 23.75 22 23.75H24C24.4142 23.75 24.75 24.0858 24.75 24.5C24.75 24.9142 24.4142 25.25 24 25.25H22C21.5858 25.25 21.25 24.9142 21.25 24.5Z'
      />
    </svg>
  );
};
