import { SVGProps } from 'react';

/**
 * 원형 정보 아이콘 컴포넌트
 * 원형 정보(i) 아이콘을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 원형 정보 아이콘 SVG 요소
 */
const CircleInfoIcon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg xmlns='http://www.w3.org/2000/svg' width='16' height='16' viewBox='0 0 16 16' fill='none' {...props}>
      <path
        fillRule='evenodd'
        clipRule='evenodd'
        d='M8.00001 2.50098C4.96244 2.50098 2.5 4.96342 2.5 8.00099C2.5 11.0386 4.96244 13.501 8.00001 13.501C11.0376 13.501 13.5 11.0386 13.5 8.00099C13.5 4.96342 11.0376 2.50098 8.00001 2.50098ZM1.5 8.00099C1.5 4.41113 4.41016 1.50098 8.00001 1.50098C11.5899 1.50098 14.5 4.41113 14.5 8.00099C14.5 11.5908 11.5899 14.501 8.00001 14.501C4.41016 14.501 1.5 11.5908 1.5 8.00099Z'
        fill='#B4B4B4'
      />
      <path
        d='M7.3335 7.40104C7.3335 7.03285 7.63197 6.73438 8.00016 6.73438C8.36835 6.73438 8.66683 7.03285 8.66683 7.40104V11.4011C8.66683 11.7692 8.36835 12.0677 8.00016 12.0677C7.63197 12.0677 7.3335 11.7692 7.3335 11.4011V7.40104Z'
        fill='#B4B4B4'
      />
      <path
        d='M7.1665 4.90104C7.1665 5.36128 7.5396 5.73438 7.99984 5.73438C8.46008 5.73438 8.83317 5.36128 8.83317 4.90104C8.83317 4.4408 8.46008 4.0677 7.99984 4.0677C7.5396 4.0677 7.1665 4.4408 7.1665 4.90104Z'
        fill='#B4B4B4'
      />
    </svg>
  );
};

export default CircleInfoIcon;
