import { SVGProps } from 'react';

/**
 * 정보 아이콘 컴포넌트
 * 정보 아이콘을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 정보 아이콘 SVG 요소
 */
export const InfoIcon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg xmlns='http://www.w3.org/2000/svg' width='20' height='20' viewBox='0 0 20 20' fill='none' {...props}>
      <path
        fillRule='evenodd'
        clipRule='evenodd'
        d='M10 3.125C6.20305 3.125 3.125 6.20305 3.125 10C3.125 13.797 6.20305 16.875 10 16.875C13.797 16.875 16.875 13.797 16.875 10C16.875 6.20305 13.797 3.125 10 3.125ZM1.875 10C1.875 5.51269 5.51269 1.875 10 1.875C14.4873 1.875 18.125 5.51269 18.125 10C18.125 14.4873 14.4873 18.125 10 18.125C5.51269 18.125 1.875 14.4873 1.875 10Z'
        fill='currentColor'
      />
      <path
        d='M9.16699 9.25033C9.16699 8.79009 9.54009 8.41699 10.0003 8.41699C10.4606 8.41699 10.8337 8.79009 10.8337 9.25033V14.2503C10.8337 14.7106 10.4606 15.0837 10.0003 15.0837C9.54009 15.0837 9.16699 14.7106 9.16699 14.2503V9.25033Z'
        fill='currentColor'
      />
      <path
        d='M8.95801 6.12532C8.95801 6.70062 9.42438 7.16699 9.99968 7.16699C10.575 7.16699 11.0413 6.70062 11.0413 6.12532C11.0413 5.55003 10.575 5.08366 9.99968 5.08366C9.42438 5.08366 8.95801 5.55003 8.95801 6.12532Z'
        fill='currentColor'
      />
    </svg>
  );
};
