import { SVGProps } from 'react';

/**
 * 링크 아이콘 컴포넌트
 * 직사각형과 화살표 형태의 링크 연결을 나타내는 아이콘을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 링크 아이콘 SVG 요소
 */
export const Link2Icon = ({ width = '20', height = '20', ...props }: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      width={width}
      height={height}
      viewBox='0 0 20 20'
      fill='currentColor'
      {...props}
    >
      <path
        fillRule='evenodd'
        clipRule='evenodd'
        d='M4.65288 15.4302C4.4088 15.1861 4.4088 14.7904 4.65288 14.5463L8.81955 10.3797C9.06363 10.1356 9.45936 10.1356 9.70343 10.3797C9.94751 10.6237 9.94751 11.0195 9.70343 11.2636L5.53676 15.4302C5.29269 15.6743 4.89696 15.6743 4.65288 15.4302Z'
        fill='currentColor'
      />
      <path
        fillRule='evenodd'
        clipRule='evenodd'
        d='M6.13193 9.98804C6.13193 9.64286 6.41175 9.36304 6.75693 9.36304L10.0949 9.36304C10.4401 9.36304 10.7199 9.64286 10.7199 9.98804L10.7199 13.326C10.7199 13.6712 10.4401 13.951 10.0949 13.951C9.74973 13.951 9.4699 13.6712 9.4699 13.326L9.4699 10.613L6.75693 10.613C6.41175 10.613 6.13193 10.3332 6.13193 9.98804Z'
        fill='currentColor'
      />
      <path
        fillRule='evenodd'
        clipRule='evenodd'
        d='M3.95801 5.58333C3.95801 4.77792 4.61093 4.125 5.41634 4.125H14.583C15.3884 4.125 16.0414 4.77792 16.0414 5.58333V14.75C16.0414 15.5554 15.3884 16.2083 14.583 16.2083H8.33301C7.98783 16.2083 7.70801 15.9285 7.70801 15.5833C7.70801 15.2382 7.98783 14.9583 8.33301 14.9583H14.583C14.6981 14.9583 14.7914 14.8651 14.7914 14.75V5.58333C14.7914 5.46827 14.6981 5.375 14.583 5.375H5.41634C5.30128 5.375 5.20801 5.46828 5.20801 5.58333V11.9167C5.20801 12.2619 4.92819 12.5417 4.58301 12.5417C4.23783 12.5417 3.95801 12.2619 3.95801 11.9167V5.58333Z'
        fill='currentColor'
      />
    </svg>
  );
};
