import { SVGProps } from 'react';

/**
 * 마지막으로 화살표 아이콘 컴포넌트
 * 오른쪽 방향 화살표 아이콘 >>을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 오른쪽 화살표 아이콘 SVG 요소
 */
export const NextArrow1Icon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      viewBox='0 0 16 16'
      width='current'
      height='current'
      fill='currentColor'
      aria-label='마지막으로 화살표'
      role='img'
      {...props}
    >
      <path d='M2.31307 13.5202C2.50833 13.7154 2.82492 13.7154 3.02018 13.5202L7.68685 8.85351C7.88211 8.65825 7.88211 8.34167 7.68685 8.14641L3.02018 3.47974C2.82492 3.28448 2.50833 3.28448 2.31307 3.47974C2.11781 3.675 2.11781 3.99158 2.31307 4.18685L6.62619 8.49996L2.31307 12.8131C2.11781 13.0083 2.11781 13.3249 2.31307 13.5202ZM8.31307 13.5202C8.50833 13.7154 8.82492 13.7154 9.02018 13.5202L13.6868 8.85351C13.8821 8.65825 13.8821 8.34167 13.6868 8.14641L9.02018 3.47974C8.82492 3.28448 8.50833 3.28448 8.31307 3.47974C8.11781 3.675 8.11781 3.99158 8.31307 4.18685L12.6262 8.49996L8.31307 12.8131C8.11781 13.0083 8.11781 13.3249 8.31307 13.5202Z' />
    </svg>
  );
};
