import { SVGProps } from 'react';

/**
 * 처음으로 화살표 아이콘 컴포넌트
 * 왼쪽 방향 화살표 아이콘 <<을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 왼쪽 화살표 아이콘 SVG 요소
 */
export const PrevArrow2Icon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      viewBox='0 0 16 16'
      width='current'
      height='current'
      fill='currentColor'
      aria-label='이전 화살표'
      role='img'
      {...props}
    >
      <path d='M13.6869 13.5202C13.4917 13.7155 13.1751 13.7155 12.9798 13.5202L8.31316 8.85357C8.11789 8.65831 8.11789 8.34173 8.31316 8.14647L12.9798 3.4798C13.1751 3.28454 13.4917 3.28454 13.6869 3.4798C13.8822 3.67506 13.8822 3.99164 13.6869 4.18691L9.37382 8.50002L13.6869 12.8131C13.8822 13.0084 13.8822 13.325 13.6869 13.5202ZM7.68693 13.5202C7.49167 13.7155 7.17508 13.7155 6.97982 13.5202L2.31315 8.85357C2.11789 8.65831 2.11789 8.34173 2.31315 8.14647L6.97982 3.4798C7.17508 3.28454 7.49167 3.28454 7.68693 3.4798C7.88219 3.67506 7.88219 3.99164 7.68693 4.18691L3.37382 8.50002L7.68693 12.8131C7.88219 13.0084 7.88219 13.325 7.68693 13.5202Z' />
    </svg>
  );
};
