import { SVGProps } from 'react';

interface TableSpinnerIconProps extends SVGProps<SVGSVGElement> {
  baseColor?: string;
  gradientColor?: string;
}

/**
 * 테이블 스피너 아이콘 컴포넌트
 * 테이블의 로딩 상태를 나타내는 스피너 아이콘입니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @param string baseColor - 기본 색상 (기본값: 'var(--Gray-G10)')
 * @param string gradientColor - 그라디언트 색상 (기본값: 'var(--KB-Yellow-Main)')
 * @returns JSX.Element 테이블 스피너 아이콘 SVG 요소
 */
export const TableSpinnerIcon = ({
  baseColor = 'var(--Gray-G10)',
  gradientColor = 'var(--KB-Yellow-Main)',
  ...props
}: TableSpinnerIconProps) => {
  return (
    <svg xmlns='http://www.w3.org/2000/svg' width='100' height='100' viewBox='0 0 100 100' fill='none' {...props}>
      <path
        d='M100 50C100 77.6142 77.6142 100 50 100C22.3858 100 0 77.6142 0 50C0 22.3858 22.3858 0 50 0C77.6142 0 100 22.3858 100 50ZM8.00293 50C8.00293 73.1943 26.8057 91.9971 50 91.9971C73.1943 91.9971 91.9971 73.1943 91.9971 50C91.9971 26.8057 73.1943 8.00293 50 8.00293C26.8057 8.00293 8.00293 26.8057 8.00293 50Z'
        fill={baseColor}
      />
      <path
        d='M77.2868 87.031C78.5978 88.8101 78.2258 91.3303 76.3475 92.4948C69.4213 96.7892 61.5314 99.3366 53.36 99.887C43.8543 100.527 34.3636 98.4383 26.0051 93.8662C17.6466 89.2941 10.7684 82.4292 6.18018 74.0795C1.59196 65.7299 -0.515253 56.2432 0.106633 46.7363C0.728519 37.2294 4.05361 28.098 9.69045 20.4172C15.3273 12.7365 23.0412 6.82603 31.9241 3.38176C40.8069 -0.0625152 50.4889 -0.897241 59.8302 0.975852C67.8602 2.58601 75.3511 6.13951 81.6588 11.2996C83.3694 12.6989 83.4099 15.2461 81.8783 16.8392C80.3468 18.4324 77.8244 18.4653 76.0928 17.0922C70.9004 12.9751 64.7911 10.1328 58.2568 8.82259C50.4107 7.2493 42.2784 7.95042 34.8173 10.8434C27.3562 13.7364 20.877 18.7008 16.1423 25.1522C11.4077 31.6036 8.61485 39.2734 8.0925 47.2587C7.57015 55.2439 9.34008 63.2122 13.1939 70.2254C17.0478 77.2386 22.8251 83.0048 29.8457 86.845C36.8663 90.6853 44.838 92.4399 52.8222 91.9021C59.4715 91.4543 65.899 89.4321 71.5835 86.0265C73.4793 84.8907 75.9758 85.2519 77.2868 87.031Z'
        fill='url(#paint0_linear_709_60594)'
      />
      <defs>
        <linearGradient
          id='paint0_linear_709_60594'
          x1='73.3333'
          y1='18.3333'
          x2='39.5833'
          y2='59.5833'
          gradientUnits='userSpaceOnUse'
        >
          <stop stopColor={gradientColor} stopOpacity='0' />
          <stop offset='1' stopColor={gradientColor} />
        </linearGradient>
      </defs>
    </svg>
  );
};
