import { SVGProps } from 'react';

/**
 * 로그아웃 아이콘 컴포넌트
 * 로그아웃을 나타내는 아이콘입니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 로그아웃 아이콘 SVG 요소
 */
export const TopLogoutBasicIcon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      version='1.1'
      viewBox='0 0 30 30'
      fill='currentColor'
      aria-label='로그아웃 아이콘'
      role='img'
      {...props}
    >
      {' '}
      <g>
        <path d='M10.49,20.53c-.23,0-.45-.08-.64-.24-.41-.35-.45-.97-.1-1.37l3.37-3.92-3.37-3.92c-.35-.41-.31-1.02.1-1.37.41-.35,1.02-.31,1.37.1l3.92,4.55c.32.37.32.91,0,1.27l-3.92,4.55c-.19.22-.46.34-.74.34Z' />
        <path d='M14.41,15.97H5.63c-.54,0-.97-.44-.97-.97s.44-.97.97-.97h8.78c.54,0,.97.44.97.97s-.44.97-.97.97Z' />
        <path d='M22.45,27.84h-10.5c-1.6,0-2.9-1.3-2.9-2.9v-1.53c0-.54.44-.97.97-.97s.97.44.97.97v1.53c0,.52.43.95.95.95h10.5c.53,0,.95-.43.95-.95V5.06c0-.52-.43-.95-.95-.95h-10.5c-.53,0-.95.43-.95.95v1.53c0,.54-.44.97-.97.97s-.97-.44-.97-.97v-1.53c0-1.6,1.3-2.9,2.9-2.9h10.5c1.6,0,2.9,1.3,2.9,2.9v19.89c0,1.6-1.3,2.9-2.9,2.9Z' />
      </g>
    </svg>
  );
};
