import { SVGProps } from 'react';

/**
 * 업로드 아이콘 컴포넌트
 * 업로드 모양의 아이콘을 표시합니다.
 *
 * @param SVGProps<SVGSVGElement> props - SVG 요소에 전달할 props (색상, 크기, 이벤트 핸들러 등)
 * @returns JSX.Element 화살표 아이콘 SVG 요소
 */
export const UploadIcon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg width='20' height='20' viewBox='0 0 20 20' fill='none' xmlns='http://www.w3.org/2000/svg' {...props}>
      <g id='Icon'>
        <path
          fillRule='evenodd'
          clipRule='evenodd'
          d='M6.22456 7.52519C5.98048 7.28112 5.98048 6.88539 6.22456 6.64131L9.5579 3.30797C9.80197 3.0639 10.1977 3.0639 10.4418 3.30797L13.7751 6.64131C14.0192 6.88539 14.0192 7.28112 13.7751 7.52519C13.531 7.76927 13.1353 7.76927 12.8912 7.52519L9.99984 4.6338L7.10845 7.52519C6.86437 7.76927 6.46864 7.76927 6.22456 7.52519Z'
          fill='currentColor'
        />
        <path
          fillRule='evenodd'
          clipRule='evenodd'
          d='M15.8335 12.2917C16.1787 12.2917 16.4585 12.5716 16.4585 12.9167V14.5834C16.4585 15.8491 15.4325 16.8751 14.1668 16.8751H5.8335C4.56784 16.8751 3.54183 15.8491 3.54183 14.5834V12.9167C3.54183 12.5716 3.82165 12.2917 4.16683 12.2917C4.51201 12.2917 4.79183 12.5716 4.79183 12.9167V14.5834C4.79183 15.1587 5.2582 15.6251 5.8335 15.6251H14.1668C14.7421 15.6251 15.2085 15.1587 15.2085 14.5834V12.9167C15.2085 12.5716 15.4883 12.2917 15.8335 12.2917Z'
          fill='currentColor'
        />
        <path
          fillRule='evenodd'
          clipRule='evenodd'
          d='M10 13.5417C9.65482 13.5417 9.375 13.2619 9.375 12.9167L9.375 3.75007C9.375 3.4049 9.65482 3.12507 10 3.12507C10.3452 3.12507 10.625 3.4049 10.625 3.75007L10.625 12.9167C10.625 13.2619 10.3452 13.5417 10 13.5417Z'
          fill='currentColor'
        />
      </g>
    </svg>
  );
};
